{
  "9dbbc08accd149d5": "Traducción tradicional basada en claves mediante loadDictionary, useTranslations y getTranslations.",
  "clientSection.badge": "useTranslations",
  "clientSection.description": "Los componentes de cliente utilizan el hook useTranslations para acceder a las entradas del diccionario. Funciona igual que la versión para servidor, pero se ejecuta en el navegador.",
  "clientSection.filterLabel": "Filtrar por categoría",
  "clientSection.noResults": "No se encontraron resultados. Prueba con otro término de búsqueda.",
  "clientSection.resultsFound": "{count} resultados encontrados",
  "clientSection.searchPlaceholder": "Busca cualquier cosa...",
  "clientSection.title": "Componente de cliente",
  "d2cb4c3481b86896": "Demostración del patrón de diccionario | Traducción general",
  "disclaimer.link": "Ver todos los ejemplos",
  "disclaimer.text": "Esta es una aplicación de ejemplo creada con General Translation para demostrar las capacidades de internacionalización (i18n).",
  "header.brand": "General Translation",
  "header.title": "Patrón de diccionario",
  "hero.description": "Esta demo muestra el patrón de diccionario tradicional usando loadDictionary, useTranslations y getTranslations. Este enfoque resulta familiar para equipos que migran de otras bibliotecas de i18n como next-intl o react-i18next.",
  "hero.heading": "Traducción basada en claves mediante diccionarios",
  "howItWorks.step1": "Define todas las cadenas traducibles en un archivo central dictionary.ts con claves anidadas.",
  "howItWorks.step2": "Usa getTranslations en componentes de servidor o useTranslations en componentes de cliente para acceder a las entradas mediante su clave.",
  "howItWorks.step3": "Ejecuta npx gtx-cli translate para generar archivos de traducción para cada configuración regional (locale). La CLI lee tu diccionario y produce archivos JSON.",
  "howItWorks.step4": "Carga las traducciones en tiempo de ejecución con loadTranslations, que importa el JSON generado para la configuración regional (locale) actual.",
  "howItWorks.title": "Cómo funciona",
  "migration.description": "El patrón de diccionario en gt-next refleja el enfoque que usan next-intl, react-i18next y bibliotecas similares. Si ya tienes archivos de traducción, puedes reutilizar tu estructura de claves e ir adoptando gradualmente las funcionalidades de gt-next.",
  "migration.title": "Migración desde otras bibliotecas",
  "prefixSection.badge": "Claves anidadas",
  "prefixSection.description": "Usa prefijos para restringir el acceso al diccionario a una sección específica. Esto mantiene el código del componente limpio y evita repetir rutas de claves largas.",
  "prefixSection.settings.language": "Idioma",
  "prefixSection.settings.notifications": "Notificaciones",
  "prefixSection.settings.privacy": "Privacidad",
  "prefixSection.settings.theme": "Tema",
  "prefixSection.title": "Limitación mediante prefijo",
  "serverSection.badge": "getTranslations",
  "serverSection.description": "Los componentes de servidor utilizan getTranslations para acceder a las entradas del diccionario. La función es asíncrona y devuelve las cadenas traducidas durante el renderizado.",
  "serverSection.greeting": "Hola, {name}!",
  "serverSection.itemCount": "Tienes {count} artículos en el carrito.",
  "serverSection.title": "Componente de servidor",
  "serverSection.welcome": "Bienvenido de nuevo al panel de control.",
  "variablesSection.badge": "Valores dinámicos",
  "variablesSection.description": "Las entradas del diccionario permiten interpolar variables usando la sintaxis de llaves. Pasa los valores como segundo argumento a la función de traducción.",
  "variablesSection.lastLogin": "Último inicio de sesión: {date}",
  "variablesSection.notification": "Tienes {count} notificaciones sin leer.",
  "variablesSection.temperature": "La temperatura actual es de {temp} grados.",
  "variablesSection.title": "Variables en traducciones"
}