{
  "clientSection.badge": "useTranslations",
  "clientSection.description": "Los componentes de cliente usan el hook useTranslations para acceder a las entradas del diccionario. Funciona igual que la versión de servidor, pero se ejecuta en el navegador.",
  "clientSection.filterLabel": "Filtrar por categoría",
  "clientSection.noResults": "No se encontraron resultados. Prueba con otro término de búsqueda.",
  "clientSection.resultsFound": "{count} resultados encontrados",
  "clientSection.searchPlaceholder": "Buscar cualquier cosa...",
  "clientSection.title": "Componente de cliente",
  "header.brand": "Información general sobre traducción",
  "header.title": "Patrón de diccionario",
  "hero.description": "Esta demostración muestra el patrón de diccionario tradicional usando loadDictionary, useTranslations y getTranslations. Este enfoque es familiar para equipos que están migrando desde otras bibliotecas de i18n como next-intl o react-i18next.",
  "hero.heading": "Traducción basada en claves usando diccionarios",
  "howItWorks.step1": "Define todas las cadenas que se vayan a traducir en un archivo central llamado dictionary.ts con claves anidadas.",
  "howItWorks.step2": "Usa getTranslations en componentes de servidor o useTranslations en componentes de cliente para acceder a las cadenas por clave.",
  "howItWorks.step3": "Ejecuta npx gtx-cli translate para generar archivos de traducción para cada locale. La CLI lee tu diccionario y genera archivos JSON.",
  "howItWorks.step4": "Carga las traducciones en tiempo de ejecución con loadTranslations, que importa el archivo JSON generado para el locale actual.",
  "howItWorks.title": "Cómo funciona",
  "migration.description": "El patrón de diccionario en gt-next refleja el enfoque utilizado por next-intl, react-i18next y bibliotecas similares. Si ya tienes archivos de traducción, puedes reutilizar tu estructura de claves existente y adoptar gradualmente las funcionalidades de gt-next.",
  "migration.title": "Migración desde otras bibliotecas",
  "prefixSection.badge": "Claves anidadas",
  "prefixSection.description": "Usa prefijos para limitar el acceso al diccionario a una sección específica. Esto mantiene el código del componente limpio y evita repetir rutas de claves largas.",
  "prefixSection.settings.language": "Idioma",
  "prefixSection.settings.notifications": "Notificaciones",
  "prefixSection.settings.privacy": "Privacidad",
  "prefixSection.settings.theme": "Tema",
  "prefixSection.title": "Limitación mediante prefijos",
  "serverSection.badge": "getTranslations",
  "serverSection.description": "Los componentes de servidor usan getTranslations para acceder a las entradas del diccionario. La función es asíncrona y devuelve las cadenas traducidas en tiempo de renderizado.",
  "serverSection.greeting": "Hola, {name}.",
  "serverSection.itemCount": "Tienes {count} productos en tu carrito.",
  "serverSection.title": "Componente de servidor",
  "serverSection.welcome": "Bienvenido de nuevo al panel de control.",
  "variablesSection.badge": "Valores dinámicos",
  "variablesSection.description": "Las entradas del diccionario permiten la interpolación de variables mediante la sintaxis con llaves. Pasa los valores como segundo argumento a la función de traducción.",
  "variablesSection.lastLogin": "Último acceso: {date}",
  "variablesSection.notification": "Tienes {count} notificaciones sin leer.",
  "variablesSection.temperature": "La temperatura actual es de {temp} grados.",
  "variablesSection.title": "Variables en las traducciones"
}