{
  "9dbbc08accd149d5": "Traduction classique pilotée par des clés à l’aide de loadDictionary, useTranslations et getTranslations.",
  "clientSection.badge": "useTranslations",
  "clientSection.description": "Les composants clients utilisent le hook useTranslations pour accéder aux entrées du dictionnaire. Il fonctionne exactement comme la version côté serveur, mais s’exécute dans le navigateur.",
  "clientSection.filterLabel": "Filtrer par catégorie",
  "clientSection.noResults": "Aucun résultat trouvé. Essayez un autre terme de recherche.",
  "clientSection.resultsFound": "{count} résultats trouvés",
  "clientSection.searchPlaceholder": "Rechercher n’importe quoi...",
  "clientSection.title": "Composant client",
  "d2cb4c3481b86896": "Démo du modèle de dictionnaire | Traduction classique",
  "disclaimer.link": "Voir tous les exemples",
  "disclaimer.text": "Il s’agit d’une application de démonstration créée avec General Translation pour présenter les capacités d’i18n.",
  "header.brand": "General Translation",
  "header.title": "Modèle de dictionnaire",
  "hero.description": "Cette démo illustre le modèle de dictionnaire traditionnel en utilisant loadDictionary, useTranslations et getTranslations. Cette approche est familière pour les équipes qui migrent depuis d’autres bibliothèques d’i18n comme next-intl ou react-i18next.",
  "hero.heading": "Traduction par clés avec des dictionnaires",
  "howItWorks.step1": "Définissez toutes les chaînes à traduire dans un fichier centralisé dictionary.ts avec des clés imbriquées.",
  "howItWorks.step2": "Utilisez getTranslations dans les composants serveur ou useTranslations dans les composants client pour accéder aux entrées par clé.",
  "howItWorks.step3": "Exécutez npx gtx-cli translate pour générer les fichiers de traduction de chaque locale. Le CLI lit votre dictionnaire et produit des fichiers JSON.",
  "howItWorks.step4": "Chargez les traductions à l’exécution avec loadTranslations, qui importe le JSON généré pour la locale actuelle.",
  "howItWorks.title": "Comment ça marche",
  "migration.description": "Le modèle de dictionnaire de gt-next suit l’approche utilisée par next-intl, react-i18next et des bibliothèques similaires. Si vous disposez déjà de fichiers de traduction, vous pouvez conserver votre structure de clés existante et adopter progressivement les fonctionnalités de gt-next.",
  "migration.title": "Migration depuis d’autres bibliothèques",
  "prefixSection.badge": "Clés imbriquées",
  "prefixSection.description": "Utilisez des préfixes pour limiter l’accès du dictionnaire à une section spécifique. Cela permet de garder le code des composants propre et d’éviter de répéter de longs chemins de clés.",
  "prefixSection.settings.language": "Langue",
  "prefixSection.settings.notifications": "Notifications",
  "prefixSection.settings.privacy": "Confidentialité",
  "prefixSection.settings.theme": "Thème",
  "prefixSection.title": "Portée par préfixe",
  "serverSection.badge": "getTranslations",
  "serverSection.description": "Les composants serveur utilisent getTranslations pour accéder aux entrées du dictionnaire. La fonction est asynchrone et renvoie les chaînes traduites au moment du rendu.",
  "serverSection.greeting": "Bonjour, {name} !",
  "serverSection.itemCount": "Vous avez {count} articles dans votre panier.",
  "serverSection.title": "Composant serveur",
  "serverSection.welcome": "Bon retour sur votre tableau de bord.",
  "variablesSection.badge": "Valeurs dynamiques",
  "variablesSection.description": "Les entrées du dictionnaire prennent en charge l’interpolation de variables à l’aide de la syntaxe entre accolades. Passez les valeurs en second argument à la fonction de traduction.",
  "variablesSection.lastLogin": "Dernière connexion : {date}",
  "variablesSection.notification": "Vous avez {count} notifications non lues.",
  "variablesSection.temperature": "La température actuelle est de {temp} degrés.",
  "variablesSection.title": "Variables dans les traductions"
}