{
  "clientSection.badge": "useTranslations",
  "clientSection.description": "Les composants côté client utilisent le hook useTranslations pour accéder aux entrées du dictionnaire. Il fonctionne de façon identique à la version serveur, mais s’exécute dans le navigateur.",
  "clientSection.filterLabel": "Filtrer par catégorie",
  "clientSection.noResults": "Aucun résultat trouvé. Essayez un autre terme de recherche.",
  "clientSection.resultsFound": "{count} résultats trouvés",
  "clientSection.searchPlaceholder": "Rechercher…",
  "clientSection.title": "Composant côté client",
  "header.brand": "Traduction générique",
  "header.title": "Modèle de dictionnaire",
  "hero.description": "Cette démo illustre le modèle de dictionnaire classique avec loadDictionary, useTranslations et getTranslations. Cette approche est familière aux équipes qui migrent depuis d’autres bibliothèques i18n comme next-intl ou react-i18next.",
  "hero.heading": "Traduction à base de clés avec dictionnaires",
  "howItWorks.step1": "Définissez toutes les chaînes à traduire dans un fichier centralisé dictionary.ts avec des clés imbriquées.",
  "howItWorks.step2": "Utilisez getTranslations dans les composants serveur ou useTranslations dans les composants client pour accéder aux entrées par clé.",
  "howItWorks.step3": "Exécutez npx gtx-cli translate pour générer les fichiers de traduction pour chaque locale. Le CLI lit votre dictionnaire et produit des fichiers JSON.",
  "howItWorks.step4": "Chargez les traductions à l’exécution avec loadTranslations, qui importe le JSON généré pour la locale actuelle.",
  "howItWorks.title": "Comment ça marche",
  "migration.description": "Le modèle de dictionnaire de gt-next reflète l’approche utilisée par next-intl, react-i18next et d’autres bibliothèques similaires. Si vous disposez déjà de fichiers de traduction, vous pouvez réutiliser votre structure de clés existante et adopter progressivement les fonctionnalités de gt-next.",
  "migration.title": "Migration depuis d’autres bibliothèques",
  "prefixSection.badge": "Clés imbriquées",
  "prefixSection.description": "Utilisez des préfixes pour limiter l’accès au dictionnaire à une section donnée. Cela permet de garder le code des composants propre et d’éviter de répéter de longs chemins de clés.",
  "prefixSection.settings.language": "Langue",
  "prefixSection.settings.notifications": "Notifications",
  "prefixSection.settings.privacy": "Confidentialité",
  "prefixSection.settings.theme": "Thème",
  "prefixSection.title": "Portée via préfixe",
  "serverSection.badge": "getTranslations",
  "serverSection.description": "Les composants serveur utilisent getTranslations pour accéder aux entrées du dictionnaire. La fonction est asynchrone et renvoie les chaînes traduites au moment du rendu.",
  "serverSection.greeting": "Bonjour, {name} !",
  "serverSection.itemCount": "Vous avez {count} articles dans votre panier.",
  "serverSection.title": "Composant serveur",
  "serverSection.welcome": "Bienvenue de nouveau sur le tableau de bord.",
  "variablesSection.badge": "Valeurs dynamiques",
  "variablesSection.description": "Les entrées du dictionnaire prennent en charge l’interpolation de variables à l’aide de la syntaxe entre accolades. Passez les valeurs en second argument de la fonction de traduction.",
  "variablesSection.lastLogin": "Dernière connexion : {date}",
  "variablesSection.notification": "Vous avez {count} notifications non lues.",
  "variablesSection.temperature": "La température actuelle est de {temp} degrés.",
  "variablesSection.title": "Variables dans les traductions"
}