{
  "9dbbc08accd149d5": "Traduction traditionnelle basée sur des clés avec loadDictionary, useTranslations et getTranslations.",
  "clientSection.badge": "useTranslations",
  "clientSection.description": "Les composants côté client utilisent le hook useTranslations pour accéder aux entrées du dictionnaire. Il fonctionne de manière identique à la version serveur, mais s’exécute dans le navigateur.",
  "clientSection.filterLabel": "Filtrer par catégorie",
  "clientSection.noResults": "Aucun résultat trouvé. Essayez un autre terme de recherche.",
  "clientSection.resultsFound": "{count} résultats trouvés",
  "clientSection.searchPlaceholder": "Rechercher n’importe quoi...",
  "clientSection.title": "Composant côté client",
  "d2cb4c3481b86896": "Démo du schéma de dictionnaire | Traduction générale",
  "header.brand": "Traduction globale",
  "header.title": "Modèle de dictionnaire",
  "hero.description": "Cette démo présente le modèle de dictionnaire traditionnel qui utilise loadDictionary, useTranslations et getTranslations. Cette approche est familière aux équipes qui migrent depuis d'autres bibliothèques i18n comme next-intl ou react-i18next.",
  "hero.heading": "Traduction à partir de clés avec des dictionnaires",
  "howItWorks.step1": "Définissez toutes les chaînes traduisibles dans un fichier centralisé dictionary.ts avec des clés imbriquées.",
  "howItWorks.step2": "Utilisez getTranslations dans les composants serveur ou useTranslations dans les composants client pour accéder aux entrées par clé.",
  "howItWorks.step3": "Exécutez la commande npx gtx-cli translate pour générer les fichiers de traduction pour chaque locale. Le CLI lit votre dictionnaire et produit des fichiers JSON.",
  "howItWorks.step4": "Chargez les traductions au moment de l’exécution avec loadTranslations, qui importe le JSON généré pour la locale actuelle.",
  "howItWorks.title": "Comment ça marche",
  "migration.description": "Le schéma de dictionnaire dans gt-next reflète l’approche utilisée par next-intl, react-i18next et des bibliothèques similaires. Si vous disposez déjà de fichiers de traduction, vous pouvez réutiliser votre structure de clés et adopter progressivement les fonctionnalités de gt-next.",
  "migration.title": "Migration depuis d’autres bibliothèques",
  "prefixSection.badge": "Clés imbriquées",
  "prefixSection.description": "Utilisez des préfixes pour limiter l’accès au dictionnaire à une section spécifique. Cela garde le code des composants lisible et évite d’avoir à répéter des chemins de clés trop longs.",
  "prefixSection.settings.language": "Langue",
  "prefixSection.settings.notifications": "Notifications",
  "prefixSection.settings.privacy": "Confidentialité",
  "prefixSection.settings.theme": "Thème",
  "prefixSection.title": "Portée par préfixe",
  "serverSection.badge": "getTranslations",
  "serverSection.description": "Les composants serveur utilisent getTranslations pour accéder aux entrées du dictionnaire. La fonction est asynchrone et renvoie les chaînes traduites au moment du rendu.",
  "serverSection.greeting": "Bonjour {name}\u0000a0!",
  "serverSection.itemCount": "Vous avez {count} articles dans votre panier.",
  "serverSection.title": "Composant serveur",
  "serverSection.welcome": "Content de vous revoir sur le tableau de bord.",
  "variablesSection.badge": "Valeurs dynamiques",
  "variablesSection.description": "Les entrées du dictionnaire prennent en charge l’interpolation de variables à l’aide d’une syntaxe à base d’accolades. Transmettez les valeurs comme deuxième argument à la fonction de traduction.",
  "variablesSection.lastLogin": "Dernière connexion : {date}",
  "variablesSection.notification": "Vous avez {count} notifications non lues.",
  "variablesSection.temperature": "La température actuelle est de {temp} degrés.",
  "variablesSection.title": "Variables dans les traductions"
}